# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

# get brew cask for apps
tap "homebrew/cask"

# Install simple cli for the Mac App Store
brew "mas"

######################################################################
# Development, console and server stuff                              #
######################################################################
brew "git"
#brew "git-extras"
#brew "git-flow"
#brew "openssl"
#cask "vagrant"
#cask "aptible"
#cask "docker"
cask "ngrok"
# ——————— Heroku Toolbet ———————
tap "heroku/brew"
brew "heroku"

######################################################################
# Databases                                                          #
######################################################################
cask "postgres"
cask "postico"
# ——————— http://gcollazo.github.io/mongodbapp/ ———————
cask "gcollazo-mongodb"
cask "redis"
#brew "redis"

######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################
cask "iterm2"
#brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "ag"
brew "jq"
brew "fzf"

######################################################################
# Text Editors                                                     #
######################################################################
brew "vim"
brew "macvim"
cask "sublime-text"
cask "vscodium"
cask "visual-studio-code"

######################################################################
# Browser                                                            #
######################################################################
cask "firefox"
tap "homebrew/cask-versions"
cask "firefox-developer-edition"
cask "google-chrome"
cask "opera"
cask "brave-browser"

######################################################################
# Utilities                                                          #
######################################################################
cask "alfred"
cask "authy"
cask "appcleaner"
cask "bartender"
cask "bitbar"
cask "dropbox"
#cask "flash"
cask "hyperswitch"
#cask 'insomnia'
cask "macpass"
cask "muzzle"
cask "mysqlworkbench"
cask "notion"
cask "shiftit"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
#cask "tableplus"
cask "teamviewer"
#cask "time-out"
#cask "the-unarchiver"		    # don't know which one ...
#cask "typora"
# ——————— Other less common utilities ———————
#brew "qt55"
#brew "imagemagick"
cask "zoomus"
#cask "sitesucker"
#cask "transmission"
brew "youtube-dl"
